# Database

Consider a table consisting of student information. The table consists of several columns like roll_no, name, date_of_birth and fees. Here, the columns are known as the attributes or characteristics, and the rows are known as Tuples (Note that, these tuples are different from the Python Tuples).

Now, consider that we have two tables "Student", consisting of students information and another table "Marks", consisting of marks of students. The Student Table has various columns like Roll_no, Name, Date_of_birth and Fees. Now, to connect the two tables together, we just need to make the column "roll_no" as the primary key, and use the references of roll_no. Note that, a primary key will always have only unique values, i.e., the primary key will not have any duplicates and blanks. Here, the table "Student" is known as the base table, and the table "Marks" is known as the derived table. Now, whenever we take the values from the primary key, i.e., roll_no and use it as a referrence in the "Marks" table, then "roll_no" is known as the "foreign key". The foreign key is used to maintain the referential integrity (Referential integrity means, we are trying to make references between the base table and the derived table, with the help of primary key and foreign key. Here, "roll_no" is the primary key. Now, whenever we derive the primary key, i.e., "roll_no" in the "Marks" table, then it becomes the foreign key.

Now, as the two tables, i.e., the "Student" table and the "Marks" table are logically related, we can keep both the tables in a set known as the "database".  

Thus, database is the collection of logically related tables.

The Database Management System (DBMS) are the softwares and technologies, that are used to create, manage and maintain the databases. These databases can then be accessed by the users.

The different database management softwares can be classified into two categories. They are:
Relational Database Management Software amd Non-Relational Database Management Software.

MS-SQL Server, MySQL, Oracle and SQLite are the Relational Database Management Softwares, where we can create a table-like structures, consisting of rows and columns. SQLite is a Relational Database Management Software, which is already present in Anaconda.

Cassandra, NoSQL and AmazonDB are the Non-Relational Database Management Softwares, where the data is not arranged in a table-like structure.

Database Management Software (DBMS) can either be licensed (proprietor) or open-source (free-ware). MS-SQL Server and Oracle are licensed (proprietor) softwares.Therefore, one needs to purchase them and maintain their license. SQLite is an open-source (free-ware) software. Therefore, one need not purchase it.

A user can access the tables stored in a Database with the help of SQL commands. SQL stands for Structured Query Language. DBMS will give us the SQL interactive system, through which the user can interact with any table, that is stored inside the Database Management Software.

There are three types of Structured Query Languages. They are:
DDL (Data Definition Language), DML (Data Manipulation Language) and DCL (Data Control Language).

When we are working with DDL, we use the commands create, alter and drop.          
When we are working with DML, we use the commands select, insert, update and delete.            
When we are working with DCL, we use the commands commit, rollback, grant and revoke.

As a database user, we work on DDL (Data Definition Language) and DML (Data Manipulation Language). The database administrator works on DCL (Data Control Language).

In [1]:
import sqlite3

Working with database using SQL (Structured Query Language)

1. Create a connection object.
2. From the connection object, create a cursor object.
3. Using the cursor object, call the execute method with create table query as the parameter.

<b>Create database</b>

In [2]:
# testdatabase will be created in Jupyter notebook Home

# first connection object


dbcon = sqlite3.connect('test_database.db')

<b>Cursor</b>  

A cursor in SQL is a temporary work area, created in system memory, when a SQL statement is executed. A SQL cursor is a set of rows together with a pointer, that identifies a current row. It is a database object to retrieve data from a result set, one row at a time.

In [3]:
# Create cursor object from connection

cur = dbcon.cursor()

<b>Create table in student_database</b>

<b>SQL data types</b>

integer ---- numeric values       
real ---- decimal values          
text ---- character values          
char(20) ---- character values

In [4]:
cur.execute('create table student8(rollno int primary key, name text, marks int)')

<b>Insert data in student table</b>

In [5]:
cur.execute('insert into student8(rollno, name, marks) values(1, "ABC", 78)')

In [6]:
results = cur.execute('select * from student8')

for res in results:
    print(res)

(1, 'ABC', 78)

In [7]:
cur.execute('insert into student8(rollno, name, marks) values(2, "John", 80)')

In [8]:
cur.execute('insert into student8(rollno, name, marks) values(3, "Andrew", 87)')

In [9]:
cur.execute('insert into student8(rollno, name, marks) values(4, "Lisa", 88)')

In [10]:
cur.execute('insert into student8(rollno, name, marks) values(5, "Jack", 94)')

In [11]:
results = cur.execute('select * from student8')

for res in results:
    print(res)

(1, 'ABC', 78)
(2, 'John', 80)
(3, 'Andrew', 87)
(4, 'Lisa', 88)
(5, 'Jack', 94)

In [12]:
# Another way of inserting the values into the table.

cur.execute('insert into student8 values(6, "TOM", 50)')

In [13]:
results = cur.execute('select * from student8')

for res in results:
    print(res)

(1, 'ABC', 78)
(2, 'John', 80)
(3, 'Andrew', 87)
(4, 'Lisa', 88)
(5, 'Jack', 94)
(6, 'TOM', 50)

In [14]:
results = cur.execute('select name from student8')

for res in results:
    print(res)

('ABC',)
('John',)
('Andrew',)
('Lisa',)
('Jack',)
('TOM',)

In [15]:
results = cur.execute('select marks from student8')

for res in results:
    print(res)

(78,)
(80,)
(87,)
(88,)
(94,)
(50,)

In [16]:
results = cur.execute('select name, marks from student8')

for res in results:
    print(res)

('ABC', 78)
('John', 80)
('Andrew', 87)
('Lisa', 88)
('Jack', 94)
('TOM', 50)

In [17]:
results = cur.execute('select rollno, name, marks from student8')

for res in results:
    print(res)

(1, 'ABC', 78)
(2, 'John', 80)
(3, 'Andrew', 87)
(4, 'Lisa', 88)
(5, 'Jack', 94)
(6, 'TOM', 50)

In [18]:
# Now, suppose we want to see a paricular row, 
# then we have to use the "where" clause.

results = cur.execute('select * from student8 where rollno = 1')

for res in results:
    print(res)

(1, 'ABC', 78)

In [19]:
results = cur.execute('select * from student8 where rollno = 2')

for res in results:
    print(res)

(2, 'John', 80)

In [20]:
results = cur.execute('select * from student8 where rollno = 5')

for res in results:
    print(res)

(5, 'Jack', 94)

In [21]:
results = cur.execute('select name from student8 where rollno = 1')

for res in results:
    print(res)

('ABC',)

In [22]:
results = cur.execute('select marks from student8 where rollno = 1')

for res in results:
    print(res)

(78,)

In [23]:
results = cur.execute('select name from student8 where rollno = 5')

for res in results:
    print(res)

('Jack',)

In [24]:
results = cur.execute('select * from student8 where rollno = 6')

for res in results:
    print(res)

(6, 'TOM', 50)

In [25]:
results = cur.execute('select * from student8 where name = "Jack"')

for res in results:
    print(res)

(5, 'Jack', 94)

In [26]:
# Another way of fetching a single row.
# fetchone() is used to fetch a single row.


results = cur.execute('select * from student8 where name = "Jack"')

results.fetchone()

(5, 'Jack', 94)

In [27]:
results = cur.execute('select * from student8 where name = "Lisa"')

results.fetchone()

(4, 'Lisa', 88)

In [28]:
# fetchall() is used to fetch all the rows.

results = cur.execute('select * from student8')
                      
results.fetchall()

[(1, 'ABC', 78),
 (2, 'John', 80),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'Jack', 94),
 (6, 'TOM', 50)]

In [29]:
# The "limit" command is used to limit the number of rows.
# Here, we are limiting the number of rows to 3.


results = cur.execute('select * from student8 limit 3')
                      
results.fetchall()

[(1, 'ABC', 78), (2, 'John', 80), (3, 'Andrew', 87)]

In [30]:
# Here, we are limiting the number of rows to 5.


results = cur.execute('select * from student8 limit 5')
                      
results.fetchall()

[(1, 'ABC', 78),
 (2, 'John', 80),
 (3, 'Andrew', 87),
 (4, 'Lisa', 88),
 (5, 'Jack', 94)]

In [31]:
# "order by" clause is used to arrange the data,
# in either ascending or descending order.

results = cur.execute('select * from student8 order by name asc')
                      
results.fetchall()

[(1, 'ABC', 78),
 (3, 'Andrew', 87),
 (5, 'Jack', 94),
 (2, 'John', 80),
 (4, 'Lisa', 88),
 (6, 'TOM', 50)]

In [32]:
results = cur.execute('select * from student8 order by name desc')
                      
results.fetchall()

[(6, 'TOM', 50),
 (4, 'Lisa', 88),
 (2, 'John', 80),
 (5, 'Jack', 94),
 (3, 'Andrew', 87),
 (1, 'ABC', 78)]

In [33]:
# Here, we get an error, because there is no column by the name "id".

results = cur.execute('select * from student8 where id=1')

for res in results:
    print(res)

OperationalError: no such column: id

In [34]:
results = cur.execute('select * from student8 where rollno=1')

for res in results:
    print(res)

(1, 'ABC', 78)

In [35]:
results = cur.execute('select * from student8 where rollno in (1,2,3)')

for res in results:
    print(res)

(1, 'ABC', 78)
(2, 'John', 80)
(3, 'Andrew', 87)

In [36]:
results = cur.execute('select * from student8 where name in ("John", "Lisa")')

for res in results:
    print(res)

(2, 'John', 80)
(4, 'Lisa', 88)

In [37]:
results = cur.execute('select * from student8 where marks between 80 and 90')

for res in results:
    print(res)

(2, 'John', 80)
(3, 'Andrew', 87)
(4, 'Lisa', 88)

In [38]:
results = cur.execute('select * from student8 where marks>80 and marks<90')

for res in results:
    print(res)

(3, 'Andrew', 87)
(4, 'Lisa', 88)

<b>Create Database</b>

In [39]:
# Let's create a new database "student_database".

import sqlite3

In [40]:
# student_database will be created in Juoyter notebook Home

# First connection object

db = sqlite3.connect("studentdatabase.db")

In [41]:
# Create cursor object from connection

cur = db.cursor()

<b>Create table in student_database</b>

In [42]:
cur.execute("create table student8 (id int primary key, name text, marks int)")

<b>Insert data in student table</b>

In [43]:
# Here, we are writing "db.commit" because we want to save the data permanently,
# so that it can be accessed later on.


cur.execute("insert into student8(id, name, marks) values(1, 'John', 90)")
db.commit()

In [44]:
# rowcount is used to find out the number of rows inserted.

print(cur.rowcount, "Record(s) inserted")

1 Record(s) inserted

In [45]:
cur.execute("insert into student8(id, name, marks) values(2, 'Teena', 100)")
db.commit()

In [47]:
results = cur.execute("select * from student8")

for row in results:
    print(row)

(1, 'John', 90)
(2, 'Teena', 100)

In [48]:
cur.execute("insert into student8(id, name, marks) values(3, 'Andrew', 70)")
db.commit()

In [49]:
results = cur.execute("select * from student8")

for row in results:
    print(row)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)

In [50]:
cur.execute("insert into student8(id, name, marks) values(4, 'Dorsey', 56)")
db.commit()

In [51]:
cur.execute("insert into student8(id, name, marks) values(5, 'David', 45)")
db.commit()

In [52]:
cur.execute("insert into student8(id, name, marks) values(6, 'Kim', 70)")
db.commit()

In [53]:
results = cur.execute("select * from student8")

for row in results:
    print(row)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)

In [54]:
# Multiple record insertion

cur.execute("insert into student8 values (7, 'Kiara', 75), (8, 'Jack', 94)")
db.commit()


# Count of records inserted

print(cur.rowcount, "Record(s) inserted")

2 Record(s) inserted

In [55]:
results = cur.execute("select * from student8")

for row in results:
    print(row)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)

In [56]:
# Note that, earlier the "student_database" that we created will be stored 
# by default in the home directory,
# where Ananconda is installed, i.e. C Drive.

# Now, let's create the database at a particular location.

# For this, first go to E Drive, and create a folder named "MySQLite_Database",
# and then execute the code below.


db1 = sqlite3.connect("E:/MySQLite_Database/empdatabase.db")

In [57]:
cur1 = db1.cursor()

In [59]:
cur1.execute("create table employee1(id int, name text, age int)")

In [60]:
cur1.execute("insert into employee1 values(1, 'Melina', 32)")
db1.commit()

In [61]:
print(cur1.rowcount, "Record(s) inserted")

1 Record(s) inserted

In [62]:
results = cur1.execute("select * from employee1")

In [63]:
for row in results:
    print(row)

(1, 'Melina', 32)

<b>Working with original database ------ student8 database</b>

# Accessing data stored in SQLite using Python

In [64]:
results = cur.execute("select * from student8")

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)

In [65]:
results = cur.execute("select id, name from student8")

for i in results:
    print(i)

(1, 'John')
(2, 'Teena')
(3, 'Andrew')
(4, 'Dorsey')
(5, 'David')
(6, 'Kim')
(7, 'Kiara')
(8, 'Jack')

In [66]:
results = cur.execute("select id, marks from student8")

for i in results:
    print(i)

(1, 90)
(2, 100)
(3, 70)
(4, 56)
(5, 45)
(6, 70)
(7, 75)
(8, 94)

In [67]:
results = cur.execute("select * from student8 where id=1")

for i in results:
    print(i)

(1, 'John', 90)

In [68]:
results = cur.execute("select * from student8 where id=2")

for i in results:
    print(i)

(2, 'Teena', 100)

In [69]:
results = cur.execute("select * from student8 where id=5")

for i in results:
    print(i)

(5, 'David', 45)

In [70]:
results = cur.execute("select * from student8 limit 3")

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)

In [71]:
results = cur.execute("select name from student8 where id=2")

for i in results:
    print(i)

('Teena',)

In [72]:
results = cur.execute("select marks from student8 where id=2")

for i in results:
    print(i)

(100,)

In [73]:
results = cur.execute("select * from student8 where name='John'")

for i in results:
    print(i)

(1, 'John', 90)

In [74]:
results = cur.execute("select marks from student8 where name='John'")

for i in results:
    print(i)

(90,)

In [75]:
results = cur.execute("select * from student8 where marks>60 and marks<90")

for i in results:
    print(i)

(3, 'Andrew', 70)
(6, 'Kim', 70)
(7, 'Kiara', 75)

In [76]:
results = cur.execute("select * from student8 where marks>40 and marks<60")

for i in results:
    print(i)

(4, 'Dorsey', 56)
(5, 'David', 45)

In [77]:
results = cur.execute("select * from student8")

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)

In [78]:
# fetchall will display all rows

results = cur.execute("select * from student8")
results.fetchall()

[(1, 'John', 90),
 (2, 'Teena', 100),
 (3, 'Andrew', 70),
 (4, 'Dorsey', 56),
 (5, 'David', 45),
 (6, 'Kim', 70),
 (7, 'Kiara', 75),
 (8, 'Jack', 94)]

In [79]:
# Order by clause

results = cur.execute("select * from student8 order by name asc")

for i in results:
    print(i)

(3, 'Andrew', 70)
(5, 'David', 45)
(4, 'Dorsey', 56)
(8, 'Jack', 94)
(1, 'John', 90)
(7, 'Kiara', 75)
(6, 'Kim', 70)
(2, 'Teena', 100)

In [80]:
results = cur.execute("select * from student8 order by name desc")

for i in results:
    print(i)

(2, 'Teena', 100)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(1, 'John', 90)
(8, 'Jack', 94)
(4, 'Dorsey', 56)
(5, 'David', 45)
(3, 'Andrew', 70)

In [81]:
# AND Operator

results = cur.execute("select * from student8 where name='David' and marks=45")

for i in results:
    print(i)

(5, 'David', 45)

In [82]:
# As there is no row with name='David' and marks=68, 
# the code below does'nt get executed.

results = cur.execute("select * from student8 where name='David' and marks=68")

for i in results:
    print(i)

In [83]:
# As there is no row with name='David' and marks=70, 
# the code below does'nt get executed.


results = cur.execute("select * from student8 where name='David' and marks=70")

for i in results:
    print(i)

In [84]:
# OR Operator

results = cur.execute("select * from student8 where id=2 or marks=70")

for i in results:
    print(i)

(2, 'Teena', 100)
(3, 'Andrew', 70)
(6, 'Kim', 70)

In [85]:
results = cur.execute("select * from student8 where id=3 or marks=100")

results.fetchall()

[(2, 'Teena', 100), (3, 'Andrew', 70)]

In [86]:
results = cur.execute("select * from student8 where id=2 or marks=70")

for i in results:
    print(i)

(2, 'Teena', 100)
(3, 'Andrew', 70)
(6, 'Kim', 70)

<b>Aggregate functions</b>

MIN -- find minimum
MAX -- find maximum
AVG -- find average
SUM -- find sum
COUNT -- count the number of rows

In [87]:
# Find minimum marks

results = cur.execute("select min(marks) from student8")

for i in results:
    print(i)

(45,)

In [88]:
# Find maximum marks

results = cur.execute("select max(marks) from student8")

for i in results:
    print(i)

(100,)

In [89]:
# Find average marks

results = cur.execute("select avg(marks) from student8")

for i in results:
    print(i)

(75.0,)

In [90]:
# Find sum

results = cur.execute("select sum(marks) from student8")

for i in results:
    print(i)

(600,)

In [91]:
results = cur.execute("select count(id) from student8")

results.fetchone()

(8,)

In [92]:
results = cur.execute("select * from student8 where marks between 65 and 85")

for i in results:
    print(i)

(3, 'Andrew', 70)
(6, 'Kim', 70)
(7, 'Kiara', 75)

In [93]:
# Here, we are trying to find out if there any rows, where marks are not inserted.
# As there are no rows, where we have not inserted marks, 
# therefore, we don't get any output.


results = cur.execute("select * from student8 where marks is null")

for i in results:
    print(i)

In [94]:
# Here, we are trying to find out the rows, where marks are inserted.

results = cur.execute("select * from student8 where marks is not null")

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)

In [95]:
# LIKE Operators

# LIKE Operators are used to find out the specific patterns
# Not that, while using LIKe Operator, "#" stands for many characters 
# and "_" stands for a single character.

# Here, we want to see all the names starting with "D"


results = cur.execute("select * from student8 where name like 'D%'")

for i in results:
    print(i)

(4, 'Dorsey', 56)
(5, 'David', 45)

In [96]:
# Here, we want to see all the names starting with "J"


results = cur.execute("select * from student8 where name like 'J%'")

for i in results:
    print(i)

(1, 'John', 90)
(8, 'Jack', 94)

In [97]:
# Here, we want to see all the names starting with any character, 
# and the second character should be "a"


results = cur.execute("select * from student8 where name like '_a%'")

for i in results:
    print(i)

(5, 'David', 45)
(8, 'Jack', 94)

In [98]:
# Here, we want to see all the names starting with any character,
# but the end character should be "m"


results = cur.execute("select * from student8 where name like '%m'")

for i in results:
    print(i)

(6, 'Kim', 70)

In [99]:
# Here, we want to see all the names starting and ending with any character,
# but in between "e" should be present


results = cur.execute("select * from student8 where name like '%e%'")

for i in results:
    print(i)

(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)

In [100]:
# Here, we want to see only those names, which comprise of 4 characters

results = cur.execute("select * from student8 where name like '____'")

for i in results:
    print(i)

(1, 'John', 90)
(8, 'Jack', 94)

In [101]:
results = cur.execute("select * from student8 where marks NOT in (70)")

results.fetchall()

[(1, 'John', 90),
 (2, 'Teena', 100),
 (4, 'Dorsey', 56),
 (5, 'David', 45),
 (7, 'Kiara', 75),
 (8, 'Jack', 94)]

In [102]:
results = cur.execute("select * from student8 where name NOT in ('Kim')")

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(7, 'Kiara', 75)
(8, 'Jack', 94)

<b>Update record</b>

In [103]:
# Update the record

sql = "update student8 set marks=81 where id=4"

cur.execute(sql)

db.commit()

In [104]:
results = cur.execute("select * from student8 where id=4")

for i in results:
    print(i)

(4, 'Dorsey', 81)

In [105]:
results = cur.execute("select * from student8")

for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 81)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)

In [106]:
# Multiple record update ysing "IN"

sql = "update student8 set marks=92 where id in(1,2)"

cur.execute(sql)

db.commit()

In [107]:
results = cur.execute("select * from student8")

for i in results:
    print(i)

(1, 'John', 92)
(2, 'Teena', 92)
(3, 'Andrew', 70)
(4, 'Dorsey', 81)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)

In [108]:
sql = "update student8 set marks=68 where id in(5,6)"

cur.execute(sql)

db.commit()

In [109]:
results = cur.execute("select * from student8")

for i in results:
    print(i)

(1, 'John', 92)
(2, 'Teena', 92)
(3, 'Andrew', 70)
(4, 'Dorsey', 81)
(5, 'David', 68)
(6, 'Kim', 68)
(7, 'Kiara', 75)
(8, 'Jack', 94)

<b>Delete any unwanted records</b>

In [110]:
sql = "delete from student8 where id=6"

cur.execute(sql)

In [111]:
results = cur.execute('select * from student8')

results.fetchall()

[(1, 'John', 92),
 (2, 'Teena', 92),
 (3, 'Andrew', 70),
 (4, 'Dorsey', 81),
 (5, 'David', 68),
 (7, 'Kiara', 75),
 (8, 'Jack', 94)]

In [112]:
sql = "delete from student8 where id=4"

cur.execute(sql)

In [113]:
results = cur.execute('select * from student8')

results.fetchall()

[(1, 'John', 92),
 (2, 'Teena', 92),
 (3, 'Andrew', 70),
 (5, 'David', 68),
 (7, 'Kiara', 75),
 (8, 'Jack', 94)]

<b>DROP table student</b>

In [114]:
sql = 'drop table student8'

results = cur.execute(sql)

In [115]:
results = cur.execute('select * from student8')

results.fetchall()

OperationalError: no such table: student8

In [116]:
db.close()

# Practice Exercise

In [117]:
conn = sqlite3.connect('anydatabase.db')

print("Opened database successfully")

Opened database successfully

In [118]:
cur = conn.cursor()

In [119]:
conn.execute('CREATE TABLE Employees2 (ID INT PRIMARY KEY, NAME TEXT, AGE INT, ADDRESS char(20), SALARY REAL)')

In [120]:
conn.execute("INSERT INTO Employees2 (ID, NAME, AGE, ADDRESS, SALARY) VALUES(1, 'Ajeet', 27, 'Delhi', 20000)")

In [121]:
conn.execute("INSERT INTO Employees2 (ID, NAME, AGE, ADDRESS, SALARY) VALUES(2, 'Allen', 22, 'London', 25000)")

In [122]:
conn.execute("INSERT INTO Employees2 (ID, NAME, AGE, ADDRESS, SALARY) VALUES(3, 'Mark', 29, 'CA', 200000.0)")

In [123]:
conn.execute("INSERT INTO Employees2 (ID, NAME, AGE, ADDRESS, SALARY) VALUES(4, 'Kanchan', 22, 'Ghaziabad', 30000)")

In [124]:
conn.commit()

In [125]:
results = cur.execute("select * from Employees2")

for row in results:
    print(row)

(1, 'Ajeet', 27, 'Delhi', 20000.0)
(2, 'Allen', 22, 'London', 25000.0)
(3, 'Mark', 29, 'CA', 200000.0)
(4, 'Kanchan', 22, 'Ghaziabad', 30000.0)

# Adding data in table with csv (comma separated values) file directly

Till now, we inserted the records one-by-one by using the insert command. Now, if we want to insert more records in the database, stored in MySQLite (let's say 100 records at once), then we have to create a data file in csv format, and store it in C Drive. We then, have to insert all the records in this csv file (Note that, we have to place comma between each record). Then, we have to call this csv file in the database, that is stored in MySQLite. Now, the data stored in the csv file will be inserted inside the table, that is present in MySQLite. This is known as importing of data inside the SQL Databases.

In [126]:
import sqlite3

In [127]:
db = sqlite3.connect("E:/MySQLite_Database/scores_database.db")

# Declare cursor
cursor = db.cursor()

In [128]:
# Create Table
cursor.execute("CREATE TABLE scores1(gender TEXT, student_id INT PRIMARY KEY, marks INT)")

In [129]:
# Insert records into the table. (single rcord inserting)
cursor.execute("INSERT INTO scores1(gender, student_id, marks) values('Male', 100, 55)")


# Save the records permanently. (If you don't commit, next time you will not see the records in the table)
db.commit()


# Count of records inserted
print(cursor.rowcount, "Record(s) inserted")

1 Record(s) inserted

# Inserting records from csv file

In [131]:
# Note that, here the file "Scores_file.csv" is present in the home directory. That's why, we are directly calling it.
# But, if the csv file in store in some directory (let's say, C Drive), then we have to specify its path.

# Note that, we can also upload the file in the Jupyter Notebook, before calling it.


with open('Scores_file.csv','r') as file:
    total_records = 0
    for row in file:
        cursor.execute("insert into scores1 values(?,?,?)", row.split(","))
        db.commit()
        total_records+=1
print(total_records, "Records inserted")

17 Records inserted

In [132]:
result = cursor.execute("SELECT * from scores1")
for row in result:
    print(row)

('Male', 100, 55)
('Male', 104, 56)
('Male', 105, 78)
('Female', 106, 36)
('Male', 107, 20)
('Female', 108, 98)
('Male', 109, 85)
('Female', 110, 69)
('Male', 111, 46)
('Female', 112, 66)
('Male', 113, 91)
('Male', 114, 48)
('Male', 115, 56)
('Female', 116, 67)
('Male', 117, 78)
('Male', 118, 89)
('Male', 119, 32)
('Female', 120, 44)

In [133]:
sql = "SELECT * FROM scores1 WHERE student_id = 104"
result = cursor.execute(sql)
for row in result:
    print(row)

('Male', 104, 56)

In [134]:
# How to change the order of records (Increasing or decreasing)

result = cursor.execute("SELECT * FROM scores1 ORDER BY marks desc")
for row in result:
    print(row)

('Female', 108, 98)
('Male', 113, 91)
('Male', 118, 89)
('Male', 109, 85)
('Male', 105, 78)
('Male', 117, 78)
('Female', 110, 69)
('Female', 116, 67)
('Female', 112, 66)
('Male', 104, 56)
('Male', 115, 56)
('Male', 100, 55)
('Male', 114, 48)
('Male', 111, 46)
('Female', 120, 44)
('Female', 106, 36)
('Male', 119, 32)
('Male', 107, 20)

In [135]:
result = cursor.execute("SELECT * FROM scores1 ORDER BY marks asc")
for row in result:
    print(row)

('Male', 107, 20)
('Male', 119, 32)
('Female', 106, 36)
('Female', 120, 44)
('Male', 111, 46)
('Male', 114, 48)
('Male', 100, 55)
('Male', 104, 56)
('Male', 115, 56)
('Female', 112, 66)
('Female', 116, 67)
('Female', 110, 69)
('Male', 105, 78)
('Male', 117, 78)
('Male', 109, 85)
('Male', 118, 89)
('Male', 113, 91)
('Female', 108, 98)

In [136]:
# Note that, even if we don't specify "asc", the marks will be arranged in ascending order.

result = cursor.execute("SELECT * FROM scores1 ORDER BY marks")
for row in result:
    print(row)

('Male', 107, 20)
('Male', 119, 32)
('Female', 106, 36)
('Female', 120, 44)
('Male', 111, 46)
('Male', 114, 48)
('Male', 100, 55)
('Male', 104, 56)
('Male', 115, 56)
('Female', 112, 66)
('Female', 116, 67)
('Female', 110, 69)
('Male', 105, 78)
('Male', 117, 78)
('Male', 109, 85)
('Male', 118, 89)
('Male', 113, 91)
('Female', 108, 98)

In [137]:
# Single Record update

sql = "UPDATE scores1 SET marks=50 WHERE student_id=107"
cursor.execute(sql)

In [138]:
# Verify if its updated

result = cursor.execute("SELECT * FROM scores1 ORDER BY student_id")
for row in result:
    print(row)

('Male', 100, 55)
('Male', 104, 56)
('Male', 105, 78)
('Female', 106, 36)
('Male', 107, 50)
('Female', 108, 98)
('Male', 109, 85)
('Female', 110, 69)
('Male', 111, 46)
('Female', 112, 66)
('Male', 113, 91)
('Male', 114, 48)
('Male', 115, 56)
('Female', 116, 67)
('Male', 117, 78)
('Male', 118, 89)
('Male', 119, 32)
('Female', 120, 44)

In [139]:
# MIN

result = cursor.execute("SELECT MIN(marks) from scores1")
print('Minimum Marks= ', result.fetchone())

Minimum Marks=  (32,)

In [140]:
# MAX

result = cursor.execute("SELECT MAX(marks) from scores1")
print('Maximum Marks= ', result.fetchone())

Maximum Marks=  (98,)

In [141]:
db.close()

----------------------------------------------------------------------------------------------------------

In [142]:
import sqlite3

Adding date in table

In [143]:
db = sqlite3.connect("E:/MySQLite_Database/sports_database.db")

In [144]:
cur = db.cursor()

constraints -----        
unique -- enter only unique values, no duplicate values        
not null -- no blank values can be inserted in table

In [145]:
cur.execute("create table sports1(id int primary key, sportname text unique, dateofevent date, country text not null)")

In [146]:
cur.execute("insert into sports1 values(1, 'cricket', '2021-11-9', 'England')")

In [147]:
# This line will throw an error, as sportname is duplicate --- unique constraint failed

cur.execute("insert into sports1 values(2, 'cricket', '2018-08-02', 'SriLanka')")

IntegrityError: UNIQUE constraint failed: sports1.sportname

In [148]:
cur.execute("insert into sports1 values(2, 'Tennis', '2018-08-02', 'SriLanka')")
print(cur.rowcount, "record(s) inserted")

1 record(s) inserted

In [149]:
results = cur.execute('select * from sports1')

results.fetchall()

[(1, 'cricket', '2021-11-9', 'England'),
 (2, 'Tennis', '2018-08-02', 'SriLanka')]

In [150]:
# This query will throw an error : not null constraint : cannot leave any field blank

cur.execute("insert into sports1 values(3, 'FootBall', '2022-05-30', NULL)")

IntegrityError: NOT NULL constraint failed: sports1.country

In [151]:
cur.execute("insert into sports1 values(3, 'FootBall', '2022-05-30', 'Australia')")
db.commit;

In [152]:
results = cur.execute('select * from sports1')

results.fetchall()

[(1, 'cricket', '2021-11-9', 'England'),
 (2, 'Tennis', '2018-08-02', 'SriLanka'),
 (3, 'FootBall', '2022-05-30', 'Australia')]

# Employee Database with DB and Python programmatically

In [185]:
import sqlite3

In [186]:
con = sqlite3.connect("E:/MySQLite_Database/emp_database.db")

In [189]:
def sql_table(con):
    cur = con.cursor()
    cur.execute("create table employee10(id integer primary key, name text, salary real,department text, position text, hiredate date)")
    con.commit()

In [190]:
# calling function

sql_table(con)

OperationalError: database is locked

In [157]:
cur = con.cursor()
cur.execute("insert into employee9 values(1, 'Jack', 9000, 'HR', 'Manager', '2019-07-09')")

In [59]:
con.commit()

In [158]:
results = cur.execute("select * from employee9")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09')]

We can also pass values/arguments to an INSERT statement in the execute() method. You can use the question mark (?) as a placeholder for each value. The syntax of the INSERT will be like the following:

cur.execute('''insert into employee9(id, name, salary, department, position, hiredate) 
values(?, ?, ?, ?, ?, ?)''', entities)

entities = (2, 'John', 4000, 'IT', 'Engineer', '2018-02-06')

In [159]:
def sql_insert(con, entities):
    cur = con.cursor()
    cur.execute('insert into employee9(id, name, salary, department, position, hiredate) values(?,?,?,?,?,?)', entities)

In [160]:
entities = (2, 'Andrew', 7000, 'IT', 'Engineer', '2015-04-06')

In [161]:
# Calling sql insert to insert the data

sql_insert(con, entities)

In [162]:
entities = (3, 'Thomas', 6000, 'HR', 'Manager', '2016-06-14')

In [163]:
sql_insert(con, entities)

In [164]:
results = cur.execute("select * from employee9")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')]

In [165]:
entities = (4, 'Rudolf', 8000, 'IT', 'Engineer', '2012-08-23')

sql_insert(con, entities)

entities = (5, 'Suzen', 10000, 'Sales', 'Sales Executive', '2018-02-19')

sql_insert(con, entities)

In [166]:
results = cur.execute("select * from employee9")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [167]:
def sql_update(con):
    cur = con.cursor()
    cur.execute('update employee9 set name="Martin" where id=1')
    con.commit()

In [168]:
sql_update(con)

In [169]:
results = cur.execute("select * from employee9")
results.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [170]:
results = cur.execute("select id, name from employee9 where salary>8000")
results.fetchall()

[(1, 'Martin'), (5, 'Suzen')]

In [171]:
results = cur.execute("select id, name from employee9 where department in ('HR')")
results.fetchall()

[(1, 'Martin'), (3, 'Thomas')]

In [172]:
results = cur.execute("select min(salary) from employee9")
results.fetchone()

(6000.0,)

In [173]:
results = cur.execute("select count(id) from employee9")
results.fetchone()

(5,)

In [174]:
results = cur.execute("select distinct(department) from employee9")
results.fetchall()

[('HR',), ('IT',), ('Sales',)]

In [175]:
results = cur.execute("select count(distinct(department)) from employee9")
results.fetchall()

[(3,)]

In [176]:
results = cur.execute("select sum(salary), position from employee9 group by position")
results.fetchall()

[(15000.0, 'Engineer'), (15000.0, 'Manager'), (10000.0, 'Sales Executive')]

In [177]:
results = cur.execute("select sum(salary), department from employee9 group by department")
results.fetchall()

[(15000.0, 'HR'), (15000.0, 'IT'), (10000.0, 'Sales')]

In [178]:
def sql_query(sql):
    cur = con.cursor()
    results = cur.execute(sql)
    return results

In [179]:
# make query
sql = "select * from employee9"

# pass query in function
respond = sql_query(sql)
respond.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [180]:
sql = "select id, name, position from employee9"

# pass query in function
respond = sql_query(sql)
respond.fetchall()

[(1, 'Martin', 'Manager'),
 (2, 'Andrew', 'Engineer'),
 (3, 'Thomas', 'Manager'),
 (4, 'Rudolf', 'Engineer'),
 (5, 'Suzen', 'Sales Executive')]

# SQLite3 Executemany (Bulk insert)

We can use the executemany statement to insert multiple rows at once.

In [181]:
entities = [(4, 'Joseph', 4000, 'Account', 'CA', '2016-12-05'), (5, 'Maria', 10000, 'Sales', 'Sales Executive', '2018-05-25')]

In [184]:
cur.executemany('insert into employee9(id, name, salary, department, position, hiredate) values(?,?,?,?,?,?)', entities)

IntegrityError: UNIQUE constraint failed: employee9.id

In [183]:
results = cur.execute("select * from employee9")

for row in results:
    print(row)

(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09')
(2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06')
(3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')
(4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23')
(5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')

In [53]:
con.close()

# Referential Integrity

Referntial integrity is used to maintain the data consistency between two tables. Rules are made in the database structure about how foreign keys should be used to ensure that changes, addition and deletion in the database maintain the data integrity. The refential integrity constraints state that if a foreign key in the first table refers to the primary key of the second table, then every value of foreign key in the first table should either be null or present in the second table.

Student (First Table)

Roll No.          Student_name          Age          Course_id ----------------------> Foreign Key
   
    1               Andrew              18              78                             This value is not allowed because this
    2               Angel               19              16 --------------------------> value is not defined is a primary key in
    3               Priya               20              56                             the course table.
    4               Analisa             21                 --------------------------> The value can be NULL as the student         |                                                                                  (Analisa) may not have taken any             |                                                                                  course.
    |
    |
Primary Key

Course (Second Table)

Course_id          Course_name          Duration(months)
    
    78              Big Data                 4
    56              Algorithm                2
    |
    |
    |
    |
Primary Key

In [87]:
import sqlite3

In [88]:
db = sqlite3.connect("E:/MySQLite_DataBase/student_course_database.db")

In [89]:
cur = db.cursor()

constraints -----
unique -- enter only unique values, no duplicate values
not null -- no blank values can be inserted in table

In [90]:
cur.execute("create table course(courseid int primary key, coursename text, duration int)")

In [93]:
cur.execute("create table student(roll_no int primary key, studentname text, age int, courseid int, foreign key(courseid) references course(courseid))")

In [94]:
cur.execute("insert into course values(78, 'Data science', 12), (56, 'Python course', 4), (101, 'Database', 7)")

print(cur.rowcount, "record(s) inserted")

db.commit;

3 record(s) inserted

In [95]:
cur.execute("insert into student values(1, 'Jack', 22, 78), (2, 'John', 21, 56), (3, 'Rudolf', 18, 78), (4, 'Jim', 21, 56)")

print(cur.rowcount, "record(s) inserted")

db.commit;

4 record(s) inserted

In [98]:
results = cur.execute("select * from course")

results.fetchall()

[(78, 'Data science', 12), (56, 'Python course', 4), (101, 'Database', 7)]

In [97]:
results = cur.execute("select * from student")

results.fetchall()

[(1, 'Jack', 22, 78),
 (2, 'John', 21, 56),
 (3, 'Rudolf', 18, 78),
 (4, 'Jim', 21, 56)]

In [99]:
results = cur.execute('select courseid from course where coursename="Data science"')

for i in results:
    print(i)

(78,)

# Subquery

In [100]:
results = cur.execute('select * from student where courseid= (select courseid from course where coursename="Data science")')

results.fetchall()

[(1, 'Jack', 22, 78), (3, 'Rudolf', 18, 78)]

In [101]:
results = cur.execute('select * from student where courseid= (select courseid from course where coursename="Python course")')

results.fetchall()

[(2, 'John', 21, 56), (4, 'Jim', 21, 56)]

# Join

<b>Different types of SQL JOINs</b>

* (INNER) JOIN : Returns records that have matching values in both tables
* LEFT (OUTER) JOIN : Returns all records from the left table, and the matched records from the right table
* RIGHT (OUTER) JOIN : Returns all records from the right table, and the matched records from the left table 
* FULL (OUTER) JOIN : Returns all records when there is a match left or right table

# INNER JOIN

In [104]:
sql = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student INNER JOIN course ON student.courseid = course.courseid"

results = cur.execute(sql)
for row in results:
    print(row)

(1, 'Jack', 78, 'Data science')
(2, 'John', 56, 'Python course')
(3, 'Rudolf', 78, 'Data science')
(4, 'Jim', 56, 'Python course')

# LEFT JOIN

In [105]:
sql = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student LEFT JOIN course ON student.courseid = course.courseid"

results = cur.execute(sql)
for row in results:
    print(row)

(1, 'Jack', 78, 'Data science')
(2, 'John', 56, 'Python course')
(3, 'Rudolf', 78, 'Data science')
(4, 'Jim', 56, 'Python course')

In [108]:
sql = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM course LEFT JOIN student ON student.courseid = course.courseid"

results = cur.execute(sql)
for row in results:
    print(row)

(1, 'Jack', 78, 'Data science')
(3, 'Rudolf', 78, 'Data science')
(2, 'John', 56, 'Python course')
(4, 'Jim', 56, 'Python course')
(None, None, 101, 'Database')

In [ ]:
RIGHT JOIN and FULL OUTER JOIN NOT SUPPORTED IN SQLITE